In [138]:
import os
import pymysql
import mysql.connector
import pymongo
from sqlalchemy import create_engine
from sqlalchemy import sql
import json

import pandas as pd
import matplotlib.pyplot as plt

In [2]:
#host_name = "mbz8dg-ds2002"
host_name = "mbz8dg-ds2002.mysql.database.azure.com"
port = "3306"

user_id = "tylermcf"
pwd = "thePassword4"
db_name = "sakila"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

In [3]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"

sqlEngine = create_engine(conn_str, pool_recycle=3600)
conn = sqlEngine.connect()

sql_query = sql.text("""
    SELECT * from category;
""")
#print(sql_query);
df = pd.read_sql(sql_query, conn);
conn.close()
df.head()

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27
3            4   Classics 2006-02-15 04:46:27
4            5     Comedy 2006-02-15 04:46:27

In [28]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()

    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(sql.text((f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")))
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [31]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)
with sqlEngine.connect() as conn:
    conn.execute(sql.text(f"DROP DATABASE IF EXISTS `{dst_dbname}`;"))
    conn.execute(sql.text(f"CREATE DATABASE `{dst_dbname}`;"))
    conn.execute(sql.text(f"USE {dst_dbname};"))
conn.close()

In [146]:
atlas_cluster_name = "cluster0"
atlas_user_name = "mbz8dg"
atlas_password = "thePassword4"

mongo_conn_str = {
    "atlas" : f"mongodb+srv://mbz8dg:thePassword4@cluster0.hkyzauy.mongodb.net/"
}
client = pymongo.MongoClient(mongo_conn_str["atlas"])
print(f"Atlas Connection String: {mongo_conn_str['atlas']}")

Atlas Connection String: mongodb+srv://mbz8dg:thePassword4@cluster0.hkyzauy.mongodb.net/

In [147]:
def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe

# dimensions: customer, staff, date

In [6]:
sql_customer = sql.text("SELECT * FROM sakila.customer;")
df_customer = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customer)
#transform
drop_cols = ['store_id','address_id',"active"]
df_customer.drop(drop_cols, axis=1,inplace=True)
df_customer.rename(columns={"customer_id":"customer_key"}, inplace= True)
df_customer.head(2)

,customer_key,first_name,last_name,email,create_date,last_update
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,2006-02-14 22:04:36,2006-02-15 04:57:20

In [149]:
print(mongo_conn_str['atlas'])
df_customer = get_mongo_dataframe(mongo_conn_str['atlas'], 'sakila', 'customer', {})
df_customer.head(2)

mongodb+srv://mbz8dg:thePassword4@cluster0.hkyzauy.mongodb.net/

ServerSelectionTimeoutError: ac-dvmcaqk-shard-00-02.hkyzauy.mongodb.net:27017: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:992),ac-dvmcaqk-shard-00-01.hkyzauy.mongodb.net:27017: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:992),ac-dvmcaqk-shard-00-00.hkyzauy.mongodb.net:27017: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:992), Timeout: 30s, Topology Description: <TopologyDescription id: 6411452a9cc528ad2afb3c0d, topology_type: ReplicaSetNoPrimary, servers: [<ServerDescription ('ac-dvmcaqk-shard-00-00.hkyzauy.mongodb.net', 27017) server_type: Unknown, rtt: None, error=AutoReconnect('ac-dvmcaqk-shard-00-00.hkyzauy.mongodb.net:27017: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:992)')>, <ServerDescription ('ac-dvmcaqk-shard-00-01.hkyzauy.mongodb.net', 27017) server_type: Unknown, rtt: None, error=AutoReconnect('ac-dvmcaqk-shard-00-01.hkyzauy.mongodb.net:27017: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:992)')>, <ServerDescription ('ac-dvmcaqk-shard-00-02.hkyzauy.mongodb.net', 27017) server_type: Unknown, rtt: None, error=AutoReconnect('ac-dvmcaqk-shard-00-02.hkyzauy.mongodb.net:27017: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:992)')>]>

In [117]:
data_dir = os.path.join(os.getcwd(), 'downloads','sakila-db')
data_file = os.path.join(data_dir, 'Staff.csv')
df_staff = pd.read_csv(data_file, header=0, index_col=False)

df_staff.drop(['picture','address_id','store_id','active'],axis=1,inplace=True)
df_staff.rename(columns={'staff_id':"staff_key"},inplace=True)
df_staff.head()

,staff_key,first_name,last_name,email,username,password,last_update
0,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,Mike,8cb2237d0679ca88db6464eac60da96345513964,2/15/06 3:57
1,2,Jon,Stephens,Jon.Stephens@sakilastaff.com,Jon,NaN,2/15/06 3:57

In [107]:
sql_date = sql.text("SELECT * FROM sakila.dim_date;")
df_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_date)
drop_cols = ['date_key','date_name_us','date_name_eu','date_name']
df_date.drop(drop_cols,axis=1,inplace=True)
df_date.rename(columns={'full_date':"date_key"},inplace=True)
df_date.head(2)

,date_key,day_of_week,day_name_of_week,day_of_month,day_of_year,weekday_weekend,week_of_year,month_name,month_of_year,is_last_day_of_month,calendar_quarter,calendar_year,calendar_year_month,calendar_year_qtr,fiscal_month_of_year,fiscal_quarter,fiscal_year,fiscal_year_month,fiscal_year_qtr
0,2000-01-01,7,Saturday,1,1,Weekend,52,January,1,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3
1,2000-01-02,1,Sunday,2,2,Weekend,52,January,1,N,1,2000,2000-01,2000Q1,7,3,2000,2000-07,2000Q3

In [10]:
db_operation = "insert"

tables = [('dim_customer', df_customer, sql.text('customer_key')),
          ('dim_staff', df_staff, 'staff_key'),
          ('dim_date', df_date, 'date_key')]

In [32]:
set_dataframe(user_id, pwd, host_name, dst_dbname, df_staff, "dim_staff", 'staff_key', "insert")
set_dataframe(user_id, pwd, host_name, dst_dbname, df_customer, "dim_customer", 'customer_key', db_operation)
set_dataframe(user_id, pwd, host_name, dst_dbname, df_date, "dim_date", 'date_key', db_operation)

# fact table: payments + rentals

In [47]:
sql_rental = sql.text(" Select * from sakila.rental;")
df_rental = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rental)
df_rental.drop(['last_update'],axis=1,inplace=True)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [43]:
sql_payment = sql.text(" Select * from sakila.payment;")
df_payment = get_dataframe(user_id, pwd, host_name, src_dbname, sql_payment)
df_payment.drop(['customer_id','staff_id','last_update',],axis=1,inplace=True)
df_payment.head(2)

   payment_id  rental_id  amount        payment_date
0           1         76    2.99 2005-05-25 11:30:37
1           2        573    0.99 2005-05-28 10:35:23

In [50]:
fact_rental = pd.merge(df_rental, df_payment, on = 'rental_id', how= 'left')
fact_rental.rename(columns={"rental_id":"fact_rental_key"}, inplace = True)
fact_rental.drop(['payment_id'], axis=1, inplace = True)
fact_rental.head(2)

,fact_rental_key,rental_date,inventory_id,customer_id,return_date,staff_id,amount,payment_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2.99,2005-05-24 22:53:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2.99,2005-05-24 22:54:33

In [54]:
ordered_columns = ['fact_rental_key','inventory_id','customer_id','staff_id','rental_date','return_date','amount','payment_date']
fact_rental = fact_rental[ordered_columns]
fact_rental.head(2)

,fact_rental_key,inventory_id,customer_id,staff_id,rental_date,return_date,amount,payment_date
0,1,367,130,1,2005-05-24 22:53:30,2005-05-26 22:04:30,2.99,2005-05-24 22:53:30
1,2,1525,459,1,2005-05-24 22:54:33,2005-05-28 19:40:33,2.99,2005-05-24 22:54:33

In [55]:
set_dataframe(user_id, pwd, host_name, dst_dbname, fact_rental, "fact_rental", 'fact_rental_key', "insert")

In [69]:
sql_test = sql.text("""


Select staff.last_name AS 'staff_name',
	count(distinct inventory_id) as 'unique_rentals',
	sum(rentals.amount) as 'total_sales'
from sakila_dw.fact_rental as rentals
inner join sakila_dw.dim_staff as staff
on rentals.staff_id = staff.staff_key
group by staff.last_name
""")

df_test = get_dataframe(user_id,pwd,host_name,'sakila_dw',sql_test)
df_test.head()

  staff_name  unique_rentals  total_sales
0    Hillyer            4036     33524.62
1   Stephens            4073     33881.94